Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_at_what_age_can_i.html.txt.tmx
Source language: en
Languages: ga

source: At what age can I?
ga: Cén aois is féidir liom?

source: Start second level education
ga: Oideachas dara leibhéal a thosú

source: • Age 12 on 1st of January in the first school year of attendance
ga: • Aois 12 ar an 1 Eanáir sa chéad bhliain scoile

source: • Age 16 or on completion of 3 years post-primary education, whichever is the later
ga: • Aois 16 nó ar chríochnú 3 bliana oideachais iarbhunscoile, cibé acu is déanaí

source: • Age 14 – up to 7 hours per day (35 hours per week) during school holidays only
ga: • Aois 14 – suas le 7 n-uaire in aghaidh an lae (35 uair in aghaidh na seachtaine) le linn laethanta saoire ón scoil amháin

source: • Age 15 – up to 8 hours per week during term-time and up to 7 hours per day (35 hours per week) during school holidays
ga: • Aois 15 – suas le 8 n-uaire le linn an téarma agus suas le 7 n-uaire in aghaidh an lae (35 uair in aghaidh na seachtaine) i rith laethanta saoire ón scoil

source: • Age 16 – up to 8 hours per day (40 hours per week)
ga: • Aois 16 – suas le 8 n-uaire in aghaidh an lae (40 uair in aghaidh na seachtaine)

source: Get the national minimum wage
ga: Íosphá náisiúnta a fháil

source: • Age 14 – 70% of minimum wage
ga: • Aois 14 – 70% den íosphá

source: • Age 18 – 80% of minimum wage
ga: • Aois 18 – 80% den íosphá

source: • Age 19 – 90% if in second year of employment after reaching age 18
ga: • Aois 19 – 90% sa dara bliain fostaíochta tar éis aois 18 a bhaint amach

source: • Age 20 – 100% if in third year of employment after reaching age 18
ga: • Aois 20 – 100% sa tríú bliain fostaíochta tar éis aois 18 a bhaint amach

source: • Age 16 – SOLAS apprentice
ga: • Aois 16 – Printíseacht SOLAS

source: • Age 18 – Army or Air Corps apprentice
ga: • Aois 18 – Printíseach san Arm nó san Aerchór

source: Join the Army or Garda Síochána
ga: A bheith mar bhall den Arm nó den Gharda Síochána

source: • Age 18 – Army, Air Corps or Naval Service
ga: • Aois 18 – Arm, Aerchór nó an tSeirbhís Chabhlaigh

source: • Age 18 – Garda Síochána
ga: • Aois 18 – An Garda Síochána

source: • No legal minimum age
ga: • Níl aon íos-aois dhlíthiúil

source: • Age 12 – boat with an engine over 3.75kW (5hp)
ga: • Aois 12 – bád le hinneall níos mó ná 3.7kW (5hp)

source: • Age 16 – motorcycle up to 11kW and up to 125cc, moped with a maximum speed of 45kph, work vehicle such as a tractor or JCB, jet ski or motor boat capable of 17 knots or more
ga: • Aois 16 – gluaisrothar suas le 11kW agus suas le 125cc, móipéid le luas uasta de 45kph, feithicil oibre cosúil le tarracóir nó JCB, scaird sciála nó mótair bád in ann 17 muirmhíle nó níos mó

source: • Age 17 – vehicle with seats for up to 8 passenger and maximum weight of 3,500kg
ga: • Aois 17 – feithiclí le suíocháin do suas le 8 paisinéirí agus uas-mheáchan 3,500kg

source: • Age 18 – motorcycle up to 35kW, goods vehicle up to 7,500kg
ga: • Aois 18 – gluaisrothar suas le 35kW, feithiclí earraí suas le 7,500kg

source: • Age 21 – goods vehicle, bus with accommodation for up to 16 passengers
ga: • Aois 21 – feithiclí earraí, bus le cóiríocht do suas le 16 paisinéir

source: • Age 0 – three-year passport
ga: • Aois 0 – pas trí bliana

source: • Age 3 – five-year passport
ga: • Aois 3 – pas cúig bliana

source: • Age 18 – ten-year passport
ga: • Aois 18 – pas deich mbliana

source: Book a holiday or flight
ga: Saoire nó eitilt a chur in áirithint

source: • Age 16 – in general
ga: • Aois 16 - go ginearálta

source: Apply for a National Age Card
ga: Iarratas a dhéanamh ar Aoischárta Náisiúnta

source: • Age 18 – if under 18 you must be accompanied by a parent in an off-licence
ga: • Aois 18 – caithfidh daoine faoi 18 a bheith faoi thionlacan tuismitheora i siopa eischeadúnais

source: You may only remain on a licensed premises up to 9pm (10pm from May-September) if accompanied by a parent
ga: Ní féidir fanacht in áitreabh ceadúnaithe ach suas go dtí 9in (10in ó Bhealtaine go Meán Fómhair) ach amháin faoi thionlacan tuismitheora

source: If aged between 15-17 years you may remain on the premises after 9pm when attending a private function at which a substantial meal is being served
ga: Má bhíonn tú 15-17 bliana d’aois, féadfaidh tú fanacht ar an áitreabh tar éis 9in nuair a bhíonn tú ag freastal ar ócáid phríobháideach ag a bhfuil béile suntasach ar fáil

source: • Age 18 – if you are under 18 you can drink alcohol in a private residence, providing you have parental consent
ga: • Aois 18 – féadfaidh daoine faoi 18 alcól a ól i dteach príobháideach le toiliú tuismitheora

source: • Age 16 – engage in gaming at an amusement hall or funfair
ga: • Aois 16 – a bheith i mbun cearrbhachais i halla siamsaíochta nó ag aonach siamsaíochta

source: • Age 18 – enter a bookies, buy a lotto ticket
ga: • Aois 18 – dul isteach i siopa geallghlacadóra, ticéad lató a cheannach

source: • Age 16 – you must have a dog licence to keep a dog
ga: • Aois 16 – caithfidh ceadúnas madra a bheith agat chun madra a choinneáil
